Revit 2024 API
ExternalService.VendorId Property
 The vendor who provided the service
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public string VendorId { get; }
Visual Basic
Public ReadOnly Property VendorId As String
	Get
Visual C++
public:
property String^ VendorId {
	String^ get ();
}
See Also
ExternalService Class
Autodesk.Revit.DB.ExternalService Namespace